package HomeWork_3.Exersise_1;

//1. Створити енум, який містить розміри одягу (XXS, XS, S, M, L). Написати в ньому абстрактий метод getDescription.
// Додати в енум в поле int euroSize, написати конструктор, який параметром буде приймати значення для поля.
//2. Створити інтерфейси "Чоловічий одяг" з методом "вдягнути чоловіка" і "Жіночий одяг" з методом "одягнути жінку".
//3. Створити абстрактний клас Одяг, який має такі поля: розмір одягу (використати створений енум), вартість, колір.
//4. Створити класи нащадки до класу Одяг -
// Футболка (реалізує також інтерфейси Чоловічий одяг і Жіночий одяг),
// Штани (реалізує також інтерфейси Чоловічий одяг і Жіночий одяг),
// Плаття (реалізує інтерфейс "Жіночий одяг"),
// Галстук (реалізує інтерфейси Чоловічий одяг).
//5.????????????????????????Створити клас Ательє, який має полем масив об'єктів Одяг (тобто в ньому можуть бути об'єкти усіх класів-нащадків),
// та 2 методи - чоловічий вибір (повертає увесь ЧОЛОВІЧИЙ одяг (підказка: instanceof оператор поможе))
// та жіночий вибір (повертає увесь ЖІНОЧИЙ одяг).????????????????????

public class Main {
    public static void main(String[] args) {
        User user_1 = new User(26, "Bohdan", Sizes.L);

        System.out.println(user_1.getSize().euroSize);

        Clothes clothes_1 = new Trousers(Sizes.L, 2000, "green");
        System.out.println(clothes_1);


    }
}
